{"pageProps":{"postData":{"id":"nextjs-32bits","contentHtml":"<h2>Installing Next.js in 32 bits</h2>\n<p>In this post I'll teach you how to install Next.js in a <strong>32 bits</strong> OS <em>(tested only with Windows 10)</em>.</p>\n<h3>Why does this even matter?</h3>\n<p>I know, I know, 32 bits Operative Systems are already obsolete and if you find yourself working in such architecture, <strong>you should upgrade to 64 bits</strong> NOW.</p>\n<p>But there are times, like in my case, where there is no alternative since maybe you are working with someone's else computer, or in an old computer and you have no time or the means to upgrade to 64 bits easily.</p>\n<h3>What happens if I try to runs Next.js in 32 bits?</h3>\n<p>The first time I tried to run Next.js in a computer using a 32 bits architecture, the error I was receiving was that, when I tried to run <strong>npm run dev</strong> to start my Next.js app, the command will just wait for a moment and then it will terminate without starting the Node server, and therefore without starting my Next.js app.</p>\n<h3>How I ended working in 32 bits?</h3>\n<p>You  may be wondering: <em>why is this fool working in such deprecated architecture?</em></p>\n<p>Well, let me explain myself. Few days ago I was working in my Next.js project, which is this website by the way, and I was having a great time working in my desktop computer that, of course, runs in a 64 bits operative system.</p>\n<p>But the issue was that a few days later I had to go to my girlfriend's house and I couldn't move my desktop computer to her house so I decided to bring my old Notebook. The issue was that I completely forgot that the Notebook was using a 32 bits version of Windows 10.</p>\n<p>Therefore when I tried to install all the necessary tools to continue working with my website project with Next.js, I found myself not being able to start the app for the NodeJS server was not starting.</p>\n<p>At first glance I thought it may be NodeJS, then I thought it was React but I lost a few hours trying to solve the problem.</p>\n<h3>How to fix it?</h3>\n<p>After trying with different versions of Next.js, NodeJS and React, I was finally able to find a build that allowed me to continue working with my Next.js app with that old computer that was running the OS in 32 bits.</p>\n<p><strong>This is the working build:</strong></p>\n<pre><code class=\"language-json\">    Next.js 12.2.5\r\n    React 18.2.0\r\n    Node 18.14.2\r\n    npm 9.5.0\n</code></pre>\n<p>With the versions of React, Node, npm and Next.js listed above I was able to finally get my Next.js app working with 32 bits.</p>\n<p>To force your project to use those specific versions of Next.js and React, you can edit your <strong>package.json</strong> file the following way, changing the values of the versions to use of next, react and react-dom.</p>\n<pre><code class=\"language-json\">{\r\n  \"dependencies\": {\r\n    \"next\": \"12.2.5\",\r\n    \"react\": \"18.2.0\",\r\n    \"react-dom\": \"18.2.0\",\r\n  },\r\n}\n</code></pre>\n<p><strong>Additional note</strong></p>\n<p>First I thought that I needed to force the use of <strong>Babel</strong> instead of <strong>SWC</strong> since I thought <strong>SWC</strong> was 64 bits only, but it seems that it works fine with <strong>SWC</strong>  too. But just in case, if you still can't get it to work with the versions of Node, React, Next and NPM that I told you, you can also force the use of <strong>Babel</strong> instead of <strong>SWC</strong> the following way.</p>\n<p><em>(This step is NOT necessary if you already made your Next.js app work in 32 bits with what I told you before.)</em></p>\n<p>Create a <strong>babel.config.js</strong> file with the following data:</p>\n<pre><code class=\"language-json\">module.exports = {\r\n   presets: ['next/babel'],\r\n    \"plugins\": []\r\n};\n</code></pre>\n<h3>How to export Static HTML files</h3>\n<p>When trying to export static generated html files, you will face some issues for new Next.js versions use a new method to export.</p>\n<p>We will need to change the image loader to <strong>akami</strong> and set output to <strong>standlone</strong> in our Next.js configuration JSON.</p>\n<p>To generate the static generated files with this old version of Next.js, you will have to do the following.</p>\n<ol>\n<li>Go to <strong>next.config.js</strong> and set the following.</li>\n</ol>\n<pre><code class=\"language-json\">/**\r\n * @type {import('next').NextConfig}\r\n */\r\nconst nextConfig = {\r\n    output: 'standalone',\r\n     trailingSlash: true,\r\n    //Básicamente este images : { unoptimized: true } fue el que me permitio generar los HTML\r\n    \r\n    images: {\r\n        unoptimized: true,\r\n        loader: 'akamai',\r\n        path: '',\r\n    },\r\n  }\r\n   \r\n  module.exports = nextConfig\n</code></pre>\n<ol start=\"2\">\n<li>\n<p>Go to the root folder of your project in the terminal and write:\r\n<strong>npx next build</strong></p>\n</li>\n<li>\n<p>Then write:\r\n<strong>npx next export</strong></p>\n</li>\n</ol>\n<h3>Final thoughts</h3>\n<p>Even if you manage to make your Next.js project in 32 bits, remember that you will be using a old version of it, therefore you will face a lot of issues trying to work in such conditions for you will not be enjoying many bug-fixes and latest features of the framework, and many new libraries made for Next.js may won't work.</p>\n<p>This is only a temporary solution for anyone in a situation where there's NO way to have a 64 bits OS working. But don't even consider working for long in 32 bits, I don't want to encourage anyone to work in such architecture and please if you find yourself in this situation consider to change to 64 bits as soon as you can.</p>\n","title":"Next.js in 32 bits.","date":"2023-10-17","description":"In this post you will learn how to make Next.js to run in a 32 bits OS."}},"__N_SSG":true}