{"pageProps":{"postData":{"id":"who-I-want-to-be","contentHtml":"<h1>What about \"be yourself?\"</h1>\n<p>We all know the phrase <em>\"Just be yourself\"</em>, and I concur that in some way. I am from Argentina and there is a song here, <em>\"Sé vos\"</em> from a band called <em>\"Almafuerte\"</em> that talks exactly about how important is to be yourself in this world,\r\nand I tried to live by that thinking many years of my life. Yes, if you are yourself sometimes life will be miserable when others look you down, when you start to doubt about yourself, about if you are doing thing wrongs or if there is\r\nsomething wrong with you that is not allowing you to insert yourself into what many people expect from us, or what they make us believe we have to expect from us.</p>\n<p>I like <em>(and I hate)</em> the <em>\"Just be yourself\"</em> advice, but there is people that make us think <em>\"I want to be like this person\"</em>, and no matter how proud we are to be ourselves we have to admit that there is people that inspire us deeply,\r\nthat make our eyes to bright, that make us feel how beautiful is to be alive just to appreciate their works and/or ideas</p>\n<p>So yes, I want to be myself, I want to be miserable and happy, I want to dream, fail, fail, fail and keep failing until I am able to do what I wish or until I am about to die so I can say to myself <em>\"I was myself, why I did such a stupid thing?\"</em>\r\nBut also I want the version of myself to be as close as some people that I admire as possible, or have a bit of the pieces of the people that make me want to be alive when things look like shit because what they did inspire to believe that even under the\r\nworst circumstances things can be achieved, and beautiful things that reach our soul and mind.</p>\n<p>Now, let me talk you about the people that remind me that life is good.</p>\n<h2>John Carmack</h2>\n<p>Follow me here. Imagine the following things.</p>\n<ol>\n<li>You are born in the 90s</li>\n<li>You are used to play 2D games</li>\n<li>Then you discover <strong>Doom</strong> and <strong>Quake</strong></li>\n<li>You realize that everything that you played before look so boring and silly now. <em>(Don't hate me 80s people, Mario bros was good and so was the Royal Game of Ur I am sure)</em></li>\n<li>You wonder how it is possible to make such wonders in a computer. How to make a 3D game to work in a screen that is actually a plane.</li>\n</ol>\n<p>Can you imagine all of that?, Great! Because that was me during my childhood, teen ages and young adult years. I did learn programming just to be able to one day make a game engine so I can try to even emulate what John Carmack did with Doom Engine and Quake engine. Did I make that engine?, hell no but I've learned so many things and spent the best moments of my life trying to figure out how to make a 2D game engine and later on a 3D game engine.</p>\n<p>I spent one year trying to make a 2D game engine using C, I failed but I did learn the basics of C.\r\nThen I spent one year trying to make a 2D Game engine using C++, I failed again but managed to make far more progress to even have a map editor working, a silly internal language for the Game Logic that actually was a programming language in Spanish, so it was a beautiful experience to me.\r\nThen, again, I tried to make a 2D game engine <em>(Actually it would be a Framework)</em> using Javascript, HTML and CSS... and then I've failed again but reached an even further state with a map editor working, and I was able to make some small games to test the engine and even finished a Shoot'em up DEMO game with it.\r\nThen, a last time, I learned some Linear Algebra, Discrete Maths and followed a basic book about WebGL to try to make my first small game engine using JS and WebGL, and guess what?, I failed again!.</p>\n<p>A failure after failure, beautiful failures because those were the happiest days of my life since I was trying to imitate one of my idols: <strong>John Carmack</strong>, creator of Doom Engine and Quake Engine.</p>\n<p>Let me tell you a bit about John Carmack. During 1978, as a child, he discovered the Space Invaders videogame and a few years later he discovered Pac-Man. Games like those left a very deep impresion on him, so he probably though <em>\"Fuck it, I want to do the same\"</em>. In fact, he wanted so badly to do the same that when he was 14 he actually broke into a school to steal Apple II computers, btw he was sentenced to a year in a juvenile home for this little crime.</p>\n<p>I could tell you more but you can always check Wikipedia, so let me put it short: Carmack was the kind of people who would try without giving a shit about <em>\"Credentials\"</em>, <em>\"Pure Mathematical Knowledge\"</em>, etc..\r\nHe could not care less about it. Many of us would be like: <em>\"Ok, I want to make a basic 3D Game Engine, so better I learn Linear Algebra, and just in case, Discrete Maths, before even trying to do work\"</em>\r\nBut John Carmack?, he laughs at us!, Fool mere mortals!</p>\n<p>He would just jump into the task with basic high school math, with poor knowledge about what a Matrix and Vector is, with trigonometry skills only.</p>\n<blockquote>\n<p>\"Linear transformation? Projection Matrix? I don't have time for your bullshit.\"\r\n-John Carmack <em>(he probably never said this.)</em></p>\n</blockquote>\n<p>That was the inspiring thing about John Carmack and the lesson I always tried to learn from him.\r\nYes, of course having the knowledge before doing a project is great, but what if you don't have all the necessary knowledge?, what if you don't even know if you have all the necessary knowledge?, you try and find out you lazy.</p>\n<p><em>\"No, but I have to read ten math books first. I need a PhD in Math to make a Tetris First\"</em>, To the hell with that, just do it.</p>\n<p>And I believe that is a great lesson, you can't even know if you truly have all the necessary tools and knowledge to achive a big project, and believe me a Game Engine is a BIG project. The only way to know is to try, and I believe that is something sometimes great to learn: The fact that sometimes you have no fucking clue and idea if you could do something but you try it, and you try it hard... BELIEVE ME, Carmack did try hard, like really hard. Could he do things faster and better if he knew advanced math and physics before trying to face the colossal task of making a 3D game engine?, yes he could, but what do we remember the most?, Doom or some university project about 3D rendering? And what trains the mind more?, to have more tools to achieve a task or to use your mind to find a solution to a problem with less tools so you are more limited to work and then your imagination needs to work hard to find solutions with tools that were not originally made for the problem you are facing?</p>\n<p>Maybe the average engineer knows far better Math and Physics than John Carmack at 1993, but I am sure that same average Engineer, with a hand in his heart, could admit that he is not so sure that he's smarter or better at problem solving as someone like John Carmack can be. He worked HARD and that's also something inspiring, he worked REALLY hard. He was no lazy genius, he was a hard working person <em>(and a bit of a genius too)</em></p>\n<h2>Leonhard Euler</h2>\n<p>This can be a bit confusing at first glance, but if there is something that Euler and Carmack have in common is <strong>HARD WORK</strong>.\r\nWhat can I say about Leonhard Euler as something that just like math a bit but not enough to be a math person?\r\nAt early age he received schooling in mathematics from his father, a student from no less than Jacob Bernoulli. He attended the University of Basel and earned a master's during his teens.</p>\n<p>Let me share you some facts to explain why I admire Euler:</p>\n<ul>\n<li>The collected works of Euler, the Opera Omnia, contains 75 volumes and over 25000 pages.</li>\n<li>After he died, Euler published 228 papers. <em>(Papers that they found in this house, obviously)</em></li>\n<li>There are more than 95 Mathematical Terms named after Euler. <em>(For comparison, there are 70 named after Gauss and 33 named after Cauchy)</em></li>\n<li>When he went completely blind at age 64, his remarkable mathematical work continued and, in fact, it even increased.</li>\n</ul>\n<p>I am not in position to explain the real beauty behind Euler math but from my small perspective, but there is something to admire about him that even I can notice: His hard work and what cam happen when you put someone that is good at doing something, loves doing it and you let him work and live to do that thing. The result is that he could change the world and inspire all the humanity.</p>\n<p>There is one little quote about Euler I wish to share, that actually was shared by Professor William Dunham in a lecture about Euler.</p>\n<blockquote>\n<p><em>Talent</em> is doing easily what others find difficult.\r\n<em>Genius</em> is doing easily what others find impossible.</p>\n</blockquote>\n<p>And Euler, by that metric, was a <strong>genius</strong>.</p>\n<p>What I admire about Euler is that it feels like he was a force of nature. Let me explain myself. He is someone doing what he loves, what he likes, and doing it no matter what. Am I blind?, I don't give a single fuck, I will keep doing math, and even do more. That was Leonhard Euler, he was doing math like the earth goes around the earth, or like the sun brights, it just happens and there is nothing you can do about it. If Euler was alive and you were about to ask me \"What is more probable to happen, Euler stop doing math or the Earth going around the Sun?\" I would have a hard time giving you an answer.</p>\n<p>I wanted to put Leonhard Euler after John Carmack in my post as my way of saying that even though I admire Carmack passion and attitude of doing hard work without maybe the great academic knowledge necessary, that does not mean that I have an anti-intellectual attitude and anti-formal education attitude. I believe that when one have to achieve something, Carmack and Euler had something in common, both where dealing with things that required them to find solutions that they were not teached in a text book how to solve it and needed imagination and skill to work around it. Yes, the toolkit of Euler was far bigger than the one of Carmack, but both were dealing with problems for which there were not a guide in a manual in their respective toolkits to deal with it.</p>\n<h2>Gilles Villeneuve</h2>\n<p>What a change, right?. I have to admit that I am not Formula 1 fan, I know a bit to nothing about cars <em>(I've never drive a car myself and I'm 29)</em> but there is something about the history of Gilles Villeneuve that touches me, and touches me deeply.</p>\n<p>Gilles Villeneuve was a Canadian F1 driver. His path was not an easy one for money was an issue during his early career since he was a professional racing driver from his late teens with no other income.\r\nLater on, he had a better income from snowmobile racing where he was very successful.</p>\n<p>To have more chances of debuting at Formula 1 he lied about his age saying he was 25 when he was actually 27 fearing he would be considered too old to be successfull.\r\nHe actually beat James Hunt and other great figures in a non-championship Formula Atlantic race in 1976. Because of that McLaren offered him a Formula One deal.\r\nMcLaren decided later to not continue with him and then Ferrari was interested in this young canadian driver.</p>\n<p>Enzo Ferrari saw in him a driver from the past, the great Tazio Nuvolari.</p>\n<blockquote>\n<p>\"When they presented me with this 'piccolo Canadese' (little Canadian), this minuscule bundle of nerves, I immediately recognised in him the physique of Nuvolari and said to myself, let's give him a try.\"</p>\n</blockquote>\n<p>I could talk to you more about him, but let me go to the point I want to make about Gilles Villeneuve: <strong>He was bold.</strong>\r\nAnd many people can be bold and that does to make them special or inspiring, sometimes that can be something annoying from a person. But Gilles was bold and a gentleman at the same time on the race track.\r\nAnd that is something that I can admire about Gilles Villeneuve: Being passionat about something you love, being bold but without forgetting that one needs to remember that there's other people around and that one can be bold, passionate without being a danger or a serious problem to others around.</p>\n<blockquote>\n<p>\"I can hurt myself; it seems impossible to me. But I know I can hurt the car, and that’s what I don’t want to do.\"\r\n-Gilles Villeneuve</p>\n</blockquote>\n<p>There are two memorable moments of what makes to me important to mention Gilles Villeneuve as an inspiration to me:</p>\n<ol>\n<li>\n<p>During the 1979 Dutch Grand Prix, Gilles had an accident and it resulted in one of the wheels of his Ferrari being nearly destroyed. Did he stopped driving?, no, he also was a force of the nature so he continued to drive even to the point where that damaged wheel was completely destroyed and ended driving a three-wheels Ferrari. The man could not care less about how expensive the car was, he just wanted to drive, and he would drive.</p>\n</li>\n<li>\n<p>During the 1979 French Grand Prix, Gilles Villeneuve and René Arnoux were having a toe-to-toe racing duel that was one of the most exciting moments in the history of Formula One, if not the most exciting one. During this duel Gilles showed what I told you before, he was bold but he was also a gentleman and this is something really hard to achieve. Being able to make a very bold and amazing duel in Formula 1 without putting in risk the other and respecting the rules of the game is something really valuable and special. Anyone can be bold breaking the rules, but being bold respecting the rules and respecting the other, THAT is the real deal. Oh, and by the way, this duel between Gilles Villeneuve and René Arnoux, one of the most memorable moments in the history of Formula 1, was not about the first position in that race but about the second. Who won that race?, who cares!, the second place was giving a more exciting and passionate moment than the first place. Sometimes you can do such a great work that no matter that you lose, or failed, you still can give the world your brighest hour at losing and failing.</p>\n</li>\n</ol>\n","title":"How some people make us dream big?","date":"2023-11-07","description":"Why is that there is some people that is able to make us imagine a world where we can dream big against all odds?"}},"__N_SSG":true}