{"pageProps":{"postData":{"id":"debug-apache-app","contentHtml":"<h2>Starting as DevOps</h2>\n<p>A few months ago I started working in a web app that had thousands of registered clients and hundreds of active clients all the time.</p>\n<p>It was a very interesting challenge for me since I used to make and work with small web apps but never something of that magnitude.</p>\n<p>We did set that web app in a Debian 12 VPS. The web app itself was a <strong>Laravel</strong> APP with <strong>Blade PHP</strong> and <strong>Angular</strong> for the frontend.\r\nThe app also had web socket servers that were hosted using <strong>Node PM2</strong></p>\n<h2>Moving from VSCode to VIM</h2>\n<p>I was used to work with <strong>Visual Studio Code</strong>, but since I started working with this web app via SSH I realized that VS Code was quite uncomfortable for me. I used a SSH extension for it that in some machines worked and in others not and it did install a folder in my dedicated server, which I didn't like too much.</p>\n<p>I was thinking in a way to be able to work from any computer, or device, easily in my server without having to configure, install, etc... something like <strong>VSCode</strong>, and <strong>VIM</strong> was the ideal solution since it was already installed in the server and also it is available in any linux terminal mostly.</p>\n<hr>\n<p><em>Fun fact:</em> Thanks to <strong>vim</strong> I was able to solve an issue using my phone, using <strong>Termux</strong>, while I was eating with my girlfriend at a restaurant. And that was cool.</p>\n<p>So that alone makes vim greater than VS Code for me while working with VPS's and Dedicated Servers remotely.</p>\n<hr>\n<h2>Creating a chroot jail for frontend developers.</h2>\n<p>During my work with this web app, we wanted to make a new frontend with the team, but the issue was that our backend code was private and should not be seen by the frontend developers. So, in order to make the enviroment safe for the frontend developers to work without breaking the server, and safe for my team so the backend code was safe, I made a <strong>chroot jail</strong> to restrict a user access to the whole filesystem and I configured it to work via <strong>SFTP</strong>.</p>\n<p>The frontend developers we hired were used to work with Visual Studio Code so I explained them how to work using the <strong>SFTP</strong> extension and how to connect to our server. We were able to allow our developers to work in a kind controlled enviroment.</p>\n<h2>System monitoring and performance issues.</h2>\n<p>While working in this project I faced some performance issues and other issues in the road. Those issues appeared mostly at night when most of the people tried to use the Web APP at the same time.</p>\n<p>I learned some valuable things I wish to share from this experience. <em>(The Web APP was hosted using Apache)</em></p>\n<ol>\n<li>Install a system monitor history in my web app in order to see if there are and, in case it happens, when the bottleneck happens. We ending installing Apache native <strong>server status</strong> and <strong>munin</strong></li>\n<li>Ensure that the <strong>DNS</strong> nameservers for my  domain were fast and good. Ex: <strong>Cloudfare</strong>.</li>\n<li><strong>Cache</strong> as must as you can, but always be careful with this, there are certaing things that you don't want to allow to be cached. You can enable cache with Apache itself but also it is good to make sure that the client browser will be able to cache the assets of your app.</li>\n<li>Use <strong>CDN</strong> to store as much assets as I can. I try to make the client to download as less resources as possible from my server.</li>\n<li>Ensure you are giving <strong>PHP</strong> <em>(or PHP-FPM)</em> enough resources to work with your server. Increase the memory limit.</li>\n<li>Optimize Apache Server for high traffic with the module <strong>MPM Worker</strong> or <strong>MPM Event</strong> and configure it to your server needs.</li>\n<li>Consider if the infrastructure for your app is the right one. In the case of our app it was decided that the best option was to set the database in a Dedicated Server just for the database. So we had two servers for our APP: One for the app itself and another one for the database only. Originally the web app was hosted all in just one server, but then we finally decided to change it to two servers: one for the app and other for the database.</li>\n</ol>\n<h2>Debug errors</h2>\n<p>Since the Web App we were working with was originally a very complex app it was not an option for our team to rewrite the whole app from scratch so it was my work to go through the whole source code, understand the app and then start working in modifications and optimizations for it. In such task I encountered lots of bugs and issues that are common in such unfinished complex software. So I will share my list of recommendations.</p>\n<ol>\n<li>READ THE ERROR LOGS!</li>\n<li>Read the error logs AGAIN!</li>\n<li>Did I say again read the logs?</li>\n<li>Cannot read the logs?, enable debug mode if possible and/or try to enable the logs.</li>\n<li>Create a test enviroment for your app. We had another VPS for our TEST APP so I could freely make any modification without breaking our main web app.</li>\n</ol>\n","title":"Finding errors from WebApp and Server: My DevOps experience.","date":"2024-04-10","description":"Follow my personal experience trying to debug, speedup and trying to solve issues with a web app hosted in a Dedicated Server."}},"__N_SSG":true}